app/Controllers/Admin/BeritaController.php

SELECT *
FROM `berita`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        //pagination
        $page = (int) ($this->request->getVar('page') ?? 1);
        $limit = (int) ($this->request->getVar('limit') ?? 5);
        $offset = ($page - 1) * $limit;

        $this->data['beritas'] = $this->model->orderBy("tanggal", "desc")->findAll($limit, $offset);