app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $beritaModel = new BeritaModel();

        $this->data['users'] = [1,2,3,4];
        $this->data['berita'] = $beritaModel->findAll();
---
SELECT *
FROM `berita`