app/Controllers/Admin/UserController.php

    public function index()
    {
        $this->data['subtitle'] = "List User";

        $this->data['users'] = $this->model->orderBy("name", "asc")->findAll();
        $roleModel = new RoleModel();
        $this->data['roles'] = $roleModel->findAll();
---
SELECT *
FROM `users`
ORDER BY `name` ASC
SELECT *
FROM `roles`