app/Controllers/Main/HomeController.php

SELECT *
FROM `berita`
ORDER BY `created_at` DESC
 LIMIT 2
---
    public function index()
    {
        $beritaModel = new BeritaModel();

        $berita = $beritaModel->orderBy('created_at', 'desc')->limit(2)->findAll();